Tekla Open API Reference for Tekla Structures 2025
GraphicObject Properties
The GraphicObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
 (Inherited from DrawingObject.)
Hideable
 Accesses the information if this object is hidden or not or if it should be.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
GraphicObject Class
Tekla.Structures.Drawing Namespace